NejcVene/STM32H7-Bluetooth-mesh/H7MeshProvisioner/Core/Src/main.c
// #if (CFG_HW_LPUART1_ENABLED == 1)
        case (uint32_t)USART1:
        	itResponses.lpUartRxFlag = 1;
        	if (LPUART_CallbackRx) {
        		LPUART_CallbackRx();
        	}
//            if(HW_hlpuart1RxCb)
//            {
//                HW_hlpuart1RxCb();
//            }
            break;
// #endif

        default:
            break;
    }

    return;
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
    switch ((uint32_t)huart->Instance)
    {
#if (CFG_HW_USART1_ENABLED == 1)
        case (uint32_t)USART1:
            if(HW_huart1TxCb)
            {
                HW_huart1TxCb();
            }
            break;
#endif

// #if (CFG_HW_LPUART1_ENABLED == 1)
        case (uint32_t)USART1:
        	itResponses.lpUartTxFlag = 1;
        	if (LPUART_CallbackTx) {
        		LPUART_CallbackTx();
        	}
//            if(HW_hlpuart1TxCb)
//            {
//                HW_hlpuart1TxCb();
//            }
            break;
// #endif

        default:
            break;
    }

    return;
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
	// initialize required data structures and communication interface
	eventQueue = createQueue();
	cmdHashTable = HT_Create(7, 11);
	commSettings = Comm_Init(&huart1, &htim2);
	NC_Init();

	// fill hash table with commands
	HT_Insert(cmdHashTable, CMD_MESH_ATEP_ROOT, &defineRootNetworkNode);
	HT_Insert(cmdHashTable, CMD_MESH_ATEP_SCAN, &scanForUnprovisionedNetworkDevices);
	HT_Insert(cmdHashTable, CMD_MESH_ATEP_PRVN, &provisionNetworkDevice);
	HT_Insert(cmdHashTable, CMD_MESH_ATEP_SCAN_RANGE, &scanForUnprovisionedNetworkDevicesOutOfRangePvrn);
	HT_Insert(cmdHashTable, CMD_MESH_ATEP_PRVN_RANGE, &provisionNetworkDeviceOutOfRangePvrn);
	HT_Insert(cmdHashTable, CMD_MESH_ATCL_GENERIC_ON_OFF_ACK, &genericOnOffSetAck);
	HT_Insert(cmdHashTable, CMD_MESH_ATCL_GENERIC_ON_OFF_GET, &genericOnOffGet);
	HT_Insert(cmdHashTable, CMD_MESH_ATCL_UNPROV, &unprovisionNetworkDevice);
	HT_Insert(cmdHashTable, CMD_FUN_UNPROV_EM_PROV, &unprovisionEmbeddedProv);
	HT_Insert(cmdHashTable, CMD_FUN_IS_EM_PROV_PROV, &isEmbeddedProvProvisioned);
	HT_Insert(cmdHashTable, CMD_FUN_PUB_SET_SUB_ADD, &pubSetSubAdd);
	HT_Insert(cmdHashTable, CMD_FUN_GET_LIB_VER, &getLibInfo);
	HT_Insert(cmdHashTable, CMD_MESH_ATCL_SENSOR_GET, &sensorGet);
	HT_Insert(cmdHashTable, CMD_FUN_PRO_TEST, &protocolStructTest);
	HT_Insert(cmdHashTable, CMD_MESH_ATCL_SENSOR_DESC_GET, &sensorDescriptorGet);
	HT_Insert(cmdHashTable, CMD_MESH_ATCL_GENERIC_LEVEL_DELTA_SET, &genericLevelDeltaSet);

	for(;;) {
		osDelay(100);
	}
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_FSM_TaskEntryPoint */
/**
* @brief Function implementing the FSM_Task thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_FSM_TaskEntryPoint */
void FSM_TaskEntryPoint(void *argument)
{
  /* USER CODE BEGIN FSM_TaskEntryPoint */
  /* Infinite loop */
	FSM_QueuedEvent_t *event;
	CMD_CommandGet_t *cmd;
	char test[50];
	for(;;) {
		if (osMessageQueueGetCount(FSM_CommandQueueHandle) > 0) {
			if (osMessageQueueGet(FSM_CommandQueueHandle, &cmd, 0, 0) == osOK) {
				sprintf(test, "CMD: %d\r\n", cmd->commandIndex);
				HAL_UART_Transmit(&huart3, (uint8_t *) test, strlen(test), 6000);
				FSM_RegisterEvent(eventQueue, MAIN_FSM_EVENT_USER, &cmd, sizeof(cmd));
				while (!isEmpty(eventQueue)) {
					if ((event = FSM_GetEvent(eventQueue))) {
						FSM_HandleEvent(&sm, event);
						FSM_FreeEvent(event);
					}
				}
			} else {
				Error_Handler();
			}
		}
		osDelay(1);
	}
  /* USER CODE END FSM_TaskEntryPoint */
}

/* USER CODE BEGIN Header_LEDIndicator_TaskEntryPoint */
/**
* @brief Function implementing the LEDIndicator_Ta thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_LEDIndicator_TaskEntryPoint */
void LEDIndicator_TaskEntryPoint(void *argument)
{
  /* USER CODE BEGIN LEDIndicator_TaskEntryPoint */
  /* Infinite loop */
	GPIO_PinState on = GPIO_PIN_RESET;
	for(;;) {
		HAL_GPIO_WritePin(GPIOJ, GPIO_PIN_2, on);
		on = !on;
		osDelay(1000);
	}
  /* USER CODE END LEDIndicator_TaskEntryPoint */
}

 /* MPU Configuration */

void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = 0x24000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_512KB;
  MPU_InitStruct.SubRegionDisable = 0x0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.BaseAddress = 0x90000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_256MB;
  MPU_InitStruct.AccessPermission = MPU_REGION_NO_ACCESS;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER2;
  MPU_InitStruct.Size = MPU_REGION_SIZE_128MB;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

